In [ ]:
cd "/content/drive/MyDrive/Colab Notebooks/ANLY2500_02_Fall2025/LC/L28"

/content/drive/MyDrive/Colab Notebooks/ANLY2500_02_Fall2025/LC/L28

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [ ]:
%pwd

'/content/drive/My Drive/Colab Notebooks/ANLY2500_02_Fall2025/LC/L28'

In [ ]:
%ls

L28_02.ipynb  sales.db

In [ ]:
%pip install jupysql duckdb duckdb-engine --quiet
# Load the SQL extension
%load_ext sql
# Setting: Show all rows
%config SqlMagic.displaylimit = None
# Connect to SQLite database
%sql sqlite:///sales.db


# Show tables
%sqlcmd tables


# Show columns in a table
%sqlcmd columns -t sale

   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 95.1/95.1 kB 3.0 MB/s eta 0:00:00
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 49.7/49.7 kB 3.4 MB/s eta 0:00:00
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 192.8/192.8 kB 9.4 MB/s eta 0:00:00
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 144.7/144.7 kB 11.4 MB/s eta 0:00:00

displaylimit: Value None will be treated as 0 (no limit)

Connecting to 'sqlite:///sales.db'

+------------------+---------+----------+---------+-------------+
|       name       |   type  | nullable | default | primary_key |
+------------------+---------+----------+---------+-------------+
|      RowNO       | INTEGER |   True   |   None  |      0      |
|     SaleDate     |   TEXT  |   True   |   None  |      0      |
|    CustomerID    | INTEGER |   True   |   None  |      0      |
|    FirstName     |   TEXT  |   True   |   None  |      0      |
|     LastName     |   TEXT  |   True   |   None  |      0      |
|     OrderID      | INTEGER |   True   |   None  |      0      |
|   ProductName    |   TEXT  |   True   |   None  |      0      |
|     Category     |   TEXT  |   True   |   None  |      0      |
|      Color       |   TEXT  |   True   |   None  |      0      |
|    SalePrice     |   REAL  |   True   |   None  |      0      |
|     Quantity     | INTEGER |   True   |   None  |      0      |
| ManufacturerName |   TEXT  |   True   |   None  |      0      |
+------------------+---------+----------+---------+-------------+

In [ ]:
%%sql
select *
from sale
limit 10
;

Running query in 'sqlite:///sales.db'

+-------+------------+------------+-----------+-----------+---------+-----------------------------------------+----------+--------------+-----------+----------+------------------+
| RowNO |  SaleDate  | CustomerID | FirstName |  LastName | OrderID |               ProductName               | Category |    Color     | SalePrice | Quantity | ManufacturerName |
+-------+------------+------------+-----------+-----------+---------+-----------------------------------------+----------+--------------+-----------+----------+------------------+
|   1   | 12/31/2013 |    1134    |  Xiafeng  |    Wang   |  191228 |        be mini vulc wns sneakers        | sneakers |    Black     |   57.65   |    1     |       Puma       |
|   2   | 12/31/2013 |    1134    |  Xiafeng  |    Wang   |  191228 |              liga sneakers              | sneakers |     Blue     |   63.05   |    1     |       Puma       |
|   3   | 12/31/2013 |    1134    |  Xiafeng  |    Wang   |  191228 |     nike air max correlate sneakers     | sneakers |    Black     |    96.6   |    1     |       Nike       |
|   4   | 12/31/2013 |    1134    |  Xiafeng  |    Wang   |  191228 |     timberland icon 6" premium boots    |  boots   |    Black     |   116.99  |    1     |    Timberland    |
|   5   | 12/31/2013 |    1134    |  Xiafeng  |    Wang   |  191228 |        torry wedge tapestry wedge       |  wedges  | Green,Multi  |   15.29   |    2     |   Fashion Lab    |
|   6   | 12/31/2013 |   14958    |  Russell  |   Baker   |  191229 |  juno buckle animal trim wedge sneaker  |  boots   | Animal Print |   22.99   |    1     |  Apple Bottoms   |
|   7   | 12/31/2013 |    3275    |  Herschel |  Webster  |  191230 |          suede classic sneakers         | sneakers |    Purple    |    53.1   |    1     |       Puma       |
|   8   |  1/1/2014  |   17448    |  Margret  |  Gilmore  |  191231 | natalia high platform suede fringe boot |  boots   |    Black     |   50.04   |    2     |      Dereon      |
|   9   |  1/1/2014  |   11852    |    Ken    |   Carey   |  191232 |           nyc 83 vlc sneakers           | sneakers |    Black     |    72.0   |    1     |      Osiris      |
|   10  |  1/1/2014  |    5230    |    Toru   | Sakaguchi |  191233 |                 chehalis                | sneakers |    Black     |   16.48   |    1     |  Royal Elastics  |
+-------+------------+------------+-----------+-----------+---------+-----------------------------------------+----------+--------------+-----------+----------+------------------+

In [ ]:
## top 10 manufacturer with largest revenue
%%sql
select ManufacturerName,
       sum(SalePrice*Quantity) as TotalRevenue,
       sum(Quantity) as TotalPairs
from sale
group by ManufacturerName
order by TotalRevenue desc
limit 10
;

Running query in 'sqlite:///sales.db'

+---------------------+--------------------+------------+
|   ManufacturerName  |    TotalRevenue    | TotalPairs |
+---------------------+--------------------+------------+
|         Nike        | 109599.5700000001  |    1517    |
|        Adidas       | 104418.25000000006 |    1431    |
|     Fashion Lab     | 73795.86000000012  |    2548    |
| Creative Recreation | 50428.97999999998  |    778     |
|         Puma        | 44206.17000000002  |    606     |
|        Reebok       | 39640.060000000056 |    467     |
|        Supra        | 38836.91000000001  |    613     |
|         Fila        | 32040.12000000006  |    588     |
|        Osiris       | 28991.08000000001  |    461     |
|      Timberland     | 28030.980000000014 |    340     |
+---------------------+--------------------+------------+

In [ ]:
%%sql
select ManufacturerName,
       sum(SalePrice*Quantity) as TotalRevenue,
       sum(Quantity) as TotalPairs
from sale
group by ManufacturerName
order by TotalPairs desc
limit 10
;

Running query in 'sqlite:///sales.db'

+---------------------+--------------------+------------+
|   ManufacturerName  |    TotalRevenue    | TotalPairs |
+---------------------+--------------------+------------+
|     Fashion Lab     | 73795.86000000012  |    2548    |
|         Nike        | 109599.5700000001  |    1517    |
|        Adidas       | 104418.25000000006 |    1431    |
|    Apple Bottoms    | 25684.050000000036 |    869     |
| Creative Recreation | 50428.97999999998  |    778     |
|     Buyers Picks    | 21863.17000000002  |    657     |
|        Supra        | 38836.91000000001  |    613     |
|         Puma        | 44206.17000000002  |    606     |
|         Fila        | 32040.12000000006  |    588     |
|        Reebok       | 39640.060000000056 |    467     |
+---------------------+--------------------+------------+

In [ ]:
# 6
%%sql
select ProductName,
       max(SalePrice) as SalePrice
from sale
;

Running query in 'sqlite:///sales.db'

+------------------------------+-----------+
|         ProductName          | SalePrice |
+------------------------------+-----------+
| wmns air max 2013 + sneakers |   180.0   |
+------------------------------+-----------+

In [ ]:
# 7
%%sql
select sum(SalePrice*Quantity) as TotalRevenue,
       ManufacturerName
from sale
group by ManufacturerName
order by TotalRevenue desc
limit 10
;

Running query in 'sqlite:///sales.db'

+--------------------+---------------------+
|    TotalRevenue    |   ManufacturerName  |
+--------------------+---------------------+
| 109599.5700000001  |         Nike        |
| 104418.25000000006 |        Adidas       |
| 73795.86000000012  |     Fashion Lab     |
| 50428.97999999998  | Creative Recreation |
| 44206.17000000002  |         Puma        |
| 39640.060000000056 |        Reebok       |
| 38836.91000000001  |        Supra        |
| 32040.12000000006  |         Fila        |
| 28991.08000000001  |        Osiris       |
| 28030.980000000014 |      Timberland     |
+--------------------+---------------------+

In [ ]:
%%sql
select sum(SalePrice*Quantity) as TotalRevenue,
       ManufacturerName
from sale
group by ManufacturerName
order by TotalRevenue desc
limit 1
;

Running query in 'sqlite:///sales.db'

+-------------------+------------------+
|    TotalRevenue   | ManufacturerName |
+-------------------+------------------+
| 109599.5700000001 |       Nike       |
+-------------------+------------------+

In [ ]:
# 8
%%sql
select sum(Quantity) as TotalPairs,
       CustomerID,
       FirstName,
       LastName
from sale
group by CustomerID
order by sum(Quantity) desc
limit 1
;

Running query in 'sqlite:///sales.db'

+------------+------------+-----------+----------+
| TotalPairs | CustomerID | FirstName | LastName |
+------------+------------+-----------+----------+
|     44     |    5135    |   Magnus  |  Ramage  |
+------------+------------+-----------+----------+

In [ ]:
# filtering: having where
# 9
%%sql
select sum(Quantity) as TotalPairs,
       OrderID
from sale
group by OrderID
having sum(Quantity)>5
order by TotalPairs desc
limit 10
;

Running query in 'sqlite:///sales.db'

+------------+---------+
| TotalPairs | OrderID |
+------------+---------+
|     11     |  195381 |
|     11     |  193256 |
|     11     |  192262 |
|     10     |  195442 |
|     10     |  195360 |
|     10     |  195097 |
|     10     |  195042 |
|     10     |  193878 |
|     10     |  193871 |
|     10     |  193647 |
+------------+---------+

In [ ]:
# 10
%%sql
select ProductName,
       Color,
       SalePrice
from sale
where Color='Green' and
      SalePrice<20
order by SalePrice desc
limit 10
;

Running query in 'sqlite:///sales.db'

+---------------------------------+-------+-----------+
|           ProductName           | Color | SalePrice |
+---------------------------------+-------+-----------+
|            knight lo            | Green |   19.99   |
|            knight lo            | Green |   19.39   |
| wmns solarsoft thong ii sandals | Green |   16.99   |
|    jayda sandal wedge w/print   | Green |   16.82   |
| wmns solarsoft thong ii sandals | Green |   16.48   |
| wmns solarsoft thong ii sandals | Green |   15.97   |
| wmns solarsoft thong ii sandals | Green |   15.97   |
| wmns solarsoft thong ii sandals | Green |    15.8   |
| wmns solarsoft thong ii sandals | Green |   15.46   |
| wmns solarsoft thong ii sandals | Green |   15.29   |
+---------------------------------+-------+-----------+

In [ ]:
# 11
%%sql
select ProductName,
       SalePrice
from sale
where SalePrice>=100 and
      SalePrice<=150
order by SalePrice desc
limit 10
;

Running query in 'sqlite:///sales.db'

+-----------------------------------------------------------+-----------+
|                        ProductName                        | SalePrice |
+-----------------------------------------------------------+-----------+
|                      jack frost boots                     |   150.0   |
|                 reebok pump fury sneakers                 |   149.99  |
|                      6" premium boots                     |   149.99  |
| basquiat : curated by swizz beatz pump omni lite sneakers |   149.99  |
| basquiat : curated by swizz beatz pump omni lite sneakers |   148.49  |
|                      jack frost boots                     |   147.0   |
|                      jack frost boots                     |   147.0   |
|                      jack frost boots                     |   147.0   |
|                 reebok pump fury sneakers                 |   146.99  |
| basquiat : curated by swizz beatz pump omni lite sneakers |   146.99  |
+-----------------------------------------------------------+-----------+

In [ ]:
%%sql
select *
from sale
limit 3
;

Running query in 'sqlite:///sales.db'

+-------+------------+------------+-----------+----------+---------+---------------------------------+----------+-------+-----------+----------+------------------+
| RowNO |  SaleDate  | CustomerID | FirstName | LastName | OrderID |           ProductName           | Category | Color | SalePrice | Quantity | ManufacturerName |
+-------+------------+------------+-----------+----------+---------+---------------------------------+----------+-------+-----------+----------+------------------+
|   1   | 12/31/2013 |    1134    |  Xiafeng  |   Wang   |  191228 |    be mini vulc wns sneakers    | sneakers | Black |   57.65   |    1     |       Puma       |
|   2   | 12/31/2013 |    1134    |  Xiafeng  |   Wang   |  191228 |          liga sneakers          | sneakers |  Blue |   63.05   |    1     |       Puma       |
|   3   | 12/31/2013 |    1134    |  Xiafeng  |   Wang   |  191228 | nike air max correlate sneakers | sneakers | Black |    96.6   |    1     |       Nike       |
+-------+------------+------------+-----------+----------+---------+---------------------------------+----------+-------+-----------+----------+------------------+